<!-- dflook/terraform-github-actions {"workspace":"multiarch-test-2","backend_type":"remote","backend":"811fd3d9c160905ae8d1fd535ab59a4256297d5402ab6a815609fa42f6246a06","plan_job_ref":"Job Test Terraform cloud #142 at https://github.com/dflook/terraform-github-actions/actions/runs/4377960102","plan_hash":"a9ebbbf331199505db97e41648a778d2acec21aef59adebed6d073f244155137","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __multiarch-test-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #142](https://github.com/dflook/terraform-github-actions/actions/runs/4377960102)